import java.lang.*;
import java.util.*;
public class Program4 {
    /*
    Написать программу, в результате работы которой выводятся на экран
первые 10 чисел гармонического ряда (форматировать вывод
     */
    public static void main(String args[]) {

        int[] nums = new int[]{1, 2, 3, 4, 5, 6, 7, 8, 9, 10};
        float[] nums2 = new float[10];
       // for (int i = nums[0]; i <= nums[-1]; i++) {
        for (int i = 1; i<= 10; i++) {
       //   nums2[i-1] = 1 / (float)i;
            System.out.printf("1/%d \t", i);
        }

    }




    }


